[

{
    "id": "n12",
    "date": "24 January 2026",
    "title": "Visit to the RBSA Friends Exhibition",
    "excerpt": "A great day out visiting the RBSA Friends Exhibition.",
    "content": "Just been to look at my pics in the Friends Exhibition at the RBSA in Brum with my wife, eldest daughter & few friends. Went for a meal, a few drinks and loads of laughs after. Good fun. Some quality artwork on display.",
    "image": "Images/Visit.jpg"
  },

{
    "id": "n11",
    "date": "22 January 2026",
    "title": "Android — Artwork of the Week",
    "excerpt": "My painting Android has been chosen as Artwork of the Week.",
    "content": "I am delighted that my painting \"Android\" has just been chosen as Birmingham Art Group's artwork of the week. My painting is included as one of the best artworks this week, from art groups all over the world.",
    "image": "Images/bag2.png"
  },




 {
    "id": "n10",
    "date": "16 January 2026",
    "title": "Highly Commended for The Beacon",
    "excerpt": "Awarded Highly Commended for my painting The Beacon.",
    "content": "Blimey! I've just been awarded a Highly Commended certificate for my oil painting titled \"The Beacon\" which is currently on display in The Friends Exhibition at the Royal Birmingham Society of Artists in St Paul's Square. There are some quality works on display (see photos). Why not truck along and have a gander.",
    "image": "Images/commend.jpg"
  },
  
  {
    "id": "n09",
    "date": "4 December 2025",
    "title": "Selected for RBSA Friends Exhibition 2026",
    "excerpt": "Two works selected for the RBSA Friends Exhibition.",
    "content": "I am over the moon. I've just had my painting TheBeacon and drawing Big Boy chosen for the Royal Society of Birmingham Artists Friends Exhibition to be held in January 2026.",
    "image": "Images/big.jpg"
  },
  
   {
    "id": "n08",
    "date": "19 November 2025",
    "title": "Featured Artist on Birmingham Art Group",
    "excerpt": "My painting The Beacon has been featured on Birmingham Art Group.",
    "content": "Really chuffed. I've just been chosen as a featured artist on the Birmingham Art Group Facebook page with my latest painting, \"The Beacon\".",
    "image": "Images/bag1.jpg"
  },
  
    {
    "id": "n07",
    "date": "6 July 2025",
    "title": "RBSA Summer Show Opens",
    "excerpt": "The Summer Show has opened at the RBSA with my painting on display.",
    "content": "The Summer Show has just started at The Royal Birmingham Society of Artists. My painting \"Rest In Peace\" is on display. There are some superb artworks on show, so why not truck along and have a look. The exhibition is on for a month.",
    "image": "Images/rest.jpg"
  },
  
   {
    "id": "n06",
    "date": "7 June 2025",
    "title": "Rest In Peace Selected for RBSA Summer Exhibition",
    "excerpt": "My painting has been chosen for the RBSA Summer Exhibition.",
    "content": "I'm over the moon. I've just had this oil painting chosen for the Royal Birmingham Society of Artists Summer Exhibition. It's titled \"Rest In Peace\".",
    "image": "Images/rest.jpg"
  },

   {
    "id": "n05",
    "date": "11 April 2025",
    "title": "Rest In Peace Chosen for London Art Biennale",
    "excerpt": "My oil painting has been selected for the London Art Biennale.",
    "content": "I'm really chuffed. I've just had this oil painting chosen for the London Art Biennale Exhibition. It's titled \"Rest In Peace\".",
    "image": "Images/rest.jpg"
  },
  
   {
    "id": "n04",
    "date": "11 December 2024",
    "title": "Thinking About Chris Selected for RBSA Friends Exhibition",
    "excerpt": "My portrait has been selected for the RBSA Friends Exhibition.",
    "content": "I'm really chuffed. I've had this painting selected for the Royal Birmingham Society of Artists Friends Exhibition. It's titled \"Thinking About Chris\" and is a portrait of Kerrie Richards & Nigel McDonald. The exhibition is at the RBSA Gallery and runs from 9th January to 8th February. If it's anything like last year's exhibition, the quality of works on display will be first class, and it'll be well worth a visit. So why not truck along and have a look.",
    "image": "Images/think.jpg"
  },
  
  
    {
    "id": "n03",
    "date": "27 July 2024",
    "title": "Opening Day at The Harley Foundation",
    "excerpt": "A great day at the opening with my niece Jen.",
    "content": "Had a fun time at The Harley Foundation opening do with my niece Jen today. Some real quality paintings on show. Pay it a visit.",
    "image": "Images/harley.jpg"
  },
  
  
  
  
  
  
  
  
 {
    "id": "n02",
    "date": "6 August 2024",
    "title": "Selected for RBSA Prize Exhibition",
    "excerpt": "Ghosts of old Park Hill chosen for the RBSA Prize Exhibition.",
    "content": "Good news — my painting \"Ghosts of old Park Hill\" has been chosen for the Royal Birmingham Society of Artists Prize Exhibition showing this September.",
    "image": "Images/ghosts.jpg"
  },

  {
    "id": "n01",
    "date": "24 July 2024",
    "title": "Ghosts of old Park Hill Selected for Exhibition",
    "excerpt": "My painting has been selected for The Harley Foundation Open Call Exhibition.",
    "content": "My painting titled \"Ghosts of old Park Hill\", based on reference photographs by Tim Ward and Shirley Baker, has been selected for The Harley Foundation Open Call Exhibition.",
    "image": "Images/ghosts.jpg"
  }
 

 







 

  










 
 



 
  


  ]
